Revit 2027 API
ElectricalDemandFactorDefinition.AdditionalLoad Property
 Additional load to be included during demand load calculation.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AdditionalLoad { get; set; }
Public Property AdditionalLoad As Double
	Get
	Set
public:
property double AdditionalLoad {
	double get ();
	void set (double value);
}
member AdditionalLoad : float with get, set
Property Value
Double
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace